src/toir_cf/src/Documents/проф_РегистрацияЦенНоменклатурыПоставщиков/проф_РегистрацияЦенНоменклатурыПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>проф_РегистрацияЦенНоменклатурыПоставщиков</name>
  <registerRecords>InformationRegister.проф_ЦеныНоменклатурыПоставщиков</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ВидЦеныПоставщика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПоставщика</name>
      <type>
        <types>CatalogRef.НоменклатураКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cf/src/InformationRegisters/проф_ЦеныНоменклатурыПоставщиков/проф_ЦеныНоменклатурыПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>проф_ЦеныНоменклатурыПоставщиков</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НоменклатураПоставщика</name>
    <type>
      <types>CatalogRef.НоменклатураКонтрагентов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦеныПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/Documents/проф_РегистрацияЦенНоменклатурыПоставщиков/ObjectModule.bsl
#Область ОбработчикиСобытий

//++ Проф-ИТ, #70, Корнилов М.С., 10.01.2024
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр проф_ЦеныНоменклатурыПоставщиков
	Для Каждого ТекСтрокаТовары Из Товары Цикл  
		Движения.проф_ЦеныНоменклатурыПоставщиков.Записывать = Истина;
		Движение = Движения.проф_ЦеныНоменклатурыПоставщиков.Добавить();
		Движение.Период                 = Дата;
		Движение.Контрагент             = Контрагент;
		Движение.ВидЦеныПоставщика      = ТекСтрокаТовары.ВидЦеныПоставщика;
		Движение.Номенклатура           = ТекСтрокаТовары.Номенклатура;
		Движение.Характеристика         = ТекСтрокаТовары.Характеристика;
		Движение.ЕдиницаИзмерения       = ТекСтрокаТовары.ЕдиницаИзмерения;
		Движение.Цена                   = ТекСтрокаТовары.Цена;
		Движение.НоменклатураПоставщика = ТекСтрокаТовары.НоменклатураПоставщика;
		Движение.Валюта                 = ТекСтрокаТовары.Валюта;
	КонецЦикла;
	
КонецПроцедуры
//-- Проф-ИТ, #70, Корнилов М.С., 10.01.2024

#КонецОбласти
